tap "algertc/kleopatra4mac"
tap "arl/arl"
tap "dart-lang/dart"
tap "epk/epk"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "joshmedeski/sesh"
tap "koekeishiya/formulae"
tap "microsoft/git"
tap "sass/sass"
# General-purpose data compression with high compression ratio
brew "xz"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# YAML Parser
brew "libyaml"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Sexy ANSI fonts for the console
brew "cfonts"
# Ruby environment tool
brew "chruby"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Thin wrapper around chruby to make it work with the Fish shell
brew "chruby-fish"
# Console Matrix
brew "cmatrix"
# Top-like interface for container metrics
brew "ctop"
# Message bus system, providing inter-application communication
brew "dbus"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# COBOL85-202x compiler supporting lots of dialect specific extensions
brew "gnucobol"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tool for glamorous shell scripts
brew "gum"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Portable Foreign Function Interface library
brew "libffi"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# Rainbows and unicorns in your console!
brew "lolcat"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Prompt theme engine for any shell
brew "oh-my-posh"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Linter for Terraform files
brew "tflint"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Tool for managing your YubiKey configuration
brew "ykman"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Vault
brew "hashicorp/tap/vault"
# Smart terminal session manager
brew "joshmedeski/sesh/sesh"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Enable Windows-like alt-tab
cask "alt-tab"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
# Privacy-focused Firefox-based browser
cask "floorp"
cask "font-meslo-lg-nerd-font"
cask "font-petit-formal-script"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Keyboard customiser
cask "karabiner-elements"
# Password manager app
cask "keepassxc"
# Open-source keystroke visualiser
cask "keycastr"
# File system integration
cask "macfuse"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Command-line shell and scripting language
cask "powershell"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# Mesh VPN based on WireGuard
cask "tailscale"
# Customizable timing of breaks
cask "time-out"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark"
# Lossless audio decoder
cask "xld"
mas "Apple Configurator", id: 1037126344
mas "Bitwarden", id: 1352778147
mas "Canva", id: 897446215
mas "Colibri", id: 1178295426
mas "Disk Speed Test", id: 425264550
mas "Double Shot", id: 1076145960
mas "Fantastical", id: 975937182
mas "Ghostery Privacy Ad Blocker", id: 6504861501
mas "Keynote", id: 409183694
mas "LocalSend", id: 1661733229
mas "Microsoft Remote Desktop", id: 1295203466
mas "Momentum", id: 1564329434
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pluralsight", id: 431748264
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Todoist", id: 585829637
mas "WhatsApp", id: 310633997
mas "WireGuard", id: 1451685025
mas "Yubico Authenticator", id: 1497506650
vscode "aaron-bond.better-comments"
vscode "albert.tabout"
vscode "beardedbear.beardedicons"
vscode "bierner.emojisense"
vscode "catppuccin.catppuccin-vsc"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "helixquar.asciidecorator"
vscode "johnpapa.vscode-peacock"
vscode "lzm0x219.vscode-markdown-github"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-repositories"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "shyykoserhiy.git-autoconfig"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-dutch"
vscode "takumii.markdowntable"
vscode "timdenholm.netscaler"
vscode "ultram4rine.vscode-choosealicense"
vscode "usernamehw.errorlens"
vscode "yahyabatulu.vscode-markdown-alert"
