tap "arl/arl"
tap "epk/epk"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "joshmedeski/sesh"
tap "microsoft/git"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Sexy ANSI fonts for the console
brew "cfonts"
# Ruby environment tool
brew "chruby"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Thin wrapper around chruby to make it work with the Fish shell
brew "chruby-fish"
# Console Matrix
brew "cmatrix"
# Configurable talking characters in ASCII art
brew "cowsay"
# Top-like interface for container metrics
brew "ctop"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tool for glamorous shell scripts
brew "gum"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Portable Foreign Function Interface library
brew "libffi"
# YAML Parser
brew "libyaml"
# Rainbows and unicorns in your console!
brew "lolcat"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@18"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Vault
brew "hashicorp/tap/vault"
# Smart terminal session manager
brew "joshmedeski/sesh/sesh"
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
cask "font-petit-formal-script"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Password manager app
cask "keepassxc"
# File system integration
cask "macfuse"
# Explorer for Azure Storage
cask "microsoft-azure-storage-explorer"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Open-source software for live streaming and screen recording
cask "obs"
# Command-line shell and scripting language
cask "powershell"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Graphical client for Git version control
cask "sourcetree"
# Mesh VPN based on Wireguard
cask "tailscale"
# Customizable timing of breaks
cask "time-out"
# Development environment
cask "vagrant"
# Gives Vagrant VMware plugin access to various VMware functionalities
cask "vagrant-vmware-utility"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network protocol analyzer
cask "wireshark"
# Lossless audio decoder
cask "xld"
mas "AdGuard for Safari", id: 1440147259
mas "Apple Configurator", id: 1037126344
mas "Bitwarden", id: 1352778147
mas "Colibri", id: 1178295426
mas "Dark Reader for Safari", id: 1438243180
mas "Disk Speed Test", id: 425264550
mas "Double Shot", id: 1076145960
mas "Hidden Bar", id: 1452453066
mas "iStat Menus", id: 1319778037
mas "Keynote", id: 409183694
mas "LocalSend", id: 1661733229
mas "Magnet", id: 441258766
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PhotoScape X", id: 929507092
mas "Pluralsight", id: 431748264
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
mas "Usercentrics Data Shield", id: 6444618480
mas "VCE Simulator", id: 1459356760
mas "WhatsApp", id: 1147396723
mas "WireGuard", id: 1451685025
vscode "aaron-bond.better-comments"
vscode "ahmadawais.shades-of-purple"
vscode "albert.tabout"
vscode "beardedbear.beardedicons"
vscode "beardedbear.beardedtheme"
vscode "bierner.emojisense"
vscode "catppuccin.catppuccin-vsc"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "lzm0x219.vscode-markdown-github"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "nur.just-black"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "shyykoserhiy.git-autoconfig"
vscode "timdenholm.netscaler"
vscode "ultram4rine.vscode-choosealicense"
vscode "yahyabatulu.vscode-markdown-alert"
